IDEA Open Model
BeamDataEc2.DeflectionSheme Property
Compatible with IDEA StatiCa v 10.1
 type of span loads
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public TypeDeflectionSheme DeflectionSheme { get; set; }
Public Property DeflectionSheme As TypeDeflectionSheme
	Get
	Set
public:
property TypeDeflectionSheme DeflectionSheme {
	TypeDeflectionSheme get ();
	void set (TypeDeflectionSheme value);
}
Property Value
Type: TypeDeflectionSheme
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace